#이전에 배웠던거 복습 * int, input, if, else, elif 

price = int(input("현재 주가를 입력하세요($): "))
if price <= 130:
    print("매수 기회입니다!💰")
else:
    print("아직, 비쌉니다. 기다리세요.☕")



price = int(input("현재 주가를 입력하세요: "))
if price < 100:
    print("초저가입니다! 강력 매수하세요!")
elif price <= 130:
    print("적정 가격입니다. 매수 추천해요.")
else:
    print("너무 비쌉니다. 관망하세요.")


#while True & break 무한 반복문과 멈춤

while True:
    talk = input("말을 걸어보세요(종료는 q): ")
    if talk == 'q':
        print("대화를 종료합니다.")
        break
    else:
        print(f"앵무새: {talk} ")


#장바구니에 물건을 담고 출력하기 - 리스트 및 무한 반복문 등 활용
cart = []

while True:
    item = input("사고 싶은 물건을 입력해주세요(종료는 q): ")
    if item == 'q':
        print("끝")
        break
    else:
        cart.append(item)
        print(f"{item}이(가) 장바구니에 담겼습니다.")

print("=== 최종 장바구니 목록 ===")
for item in cart:
    print(f"-{item}")



#스타벅스 키오스크 만들기
print("=== 메뉴판 ===")
menu_list = ["아메리카노(1500원)","라떼(2500원)","종료(q)"]
total_price = 0 #while True 반복문 안에 두면 가격이 계속 0원으로 초기화 됨! 바깥으로 빼내는 게 맞음

print(menu_list) # meun_list 와 선택한 메뉴인 menu 는 분리할 수 있도록


while True:
    menu = input("메뉴를 선택하세요: ")
    if menu == 'q':
        print(f"총 주문 금액은 {total_price}원 입니다.")
        break
    elif menu == '아메리카노':
        total_price = total_price + 1500
    elif menu == '라떼':
        total_price = total_price + 2500
    else:
        print("그런 메뉴는 없습니다.")
    
#다음 시간에 배울 것 : 딕셔너리!